[
    {
        "id": "1",
        "name": "HTML",
        "time": "12h 30m",
        "coursePrice": "80",
        "ratings": "4.5",
        "thumbnail": "https://i.postimg.cc/VkXPRSX3/html.jpg",
        "instructor": "John Bura",
        "lesson": "6",
        "details_info": {
            "description": "  Have you ever wanted to learn to code but don't know where to start? Learning how to code can get you a better job and lead to a better future. This course starts you off with the basic coding language of HTML. This is a very condensed 1 hour tutorial that will show you how to code in HTML. Enroll to begin your journey to be a web development master.  Take this 1 hour course as the absolute first course you take in coding. It's short and to the point. You won't regret it. HTML is the building block of the web and other markup languages. This is the foundational course you need to have in your library.The best part is that this is for complete beginners! Coding is a fantastic career to get into and this is the first course you should take. All web developers start with HTML and it is by far the easiest language toJust think of all of the things you can do in 1 hour and imagine learning a whole new skill. That's why these 1 hour lessons are so valuable. Take a look at the reviews, they speak for themselves.What are you waiting for, enroll today.",
            "topics": [
                "Tag",
                "Table",
                "Adding an image",
                "Setting up a link",
                "Adding a link to the image",
                "Bold, Italics, underline and tags within tags",
                "Lists",
                "z-index",
                "Overflow create a profile picture",
                "Media queries",
                "Bold, Italics, underline and tags within tags",
                "Forms",
                "Submit buttons",
                "Script tags and javascript"
            ]
        }
    },
    {
        "id": "2",
        "name": "CSS",
        "time": "10h 30m",
        "coursePrice": "100",
        "ratings": "4.3",
        "thumbnail": "https://i.postimg.cc/J4fWZ3HN/css.webp",
        "instructor": "Kim Chen",
        "lesson": "7",
        "details_info": {
            "description": "The Cascading Style Sheets, also known as CSS is one of the important technologies of the World Wide Web (WWW). CSS is used to represent an HTML document in a more beautiful way.Learning CSS begins important again since the born of Tailwind CSS. Tailwind CSS is a fast way to do the CSS and it is more flexible than any framework like Bootstrap, MaterializeCSS or MaterialUI.This course will start from CSS basics, then gradually moves to CSS positioning, responsive design, and flexbox.If you are looking for an online course to learn CSS then there is no better place than this,Learn CSS in this course for beginners. CSS, or Cascading Style Sheet, is responsible for the styling and looks of a website. In this course, you will learn CSS from the ground up. You will learn everything from basic skills, such as coloring and text.",
            "topics": [
                "Box model",
                "Normal flow and float",
                "Clear float and pseudo-element",
                "Two columns",
                "Two columns without float",
                "Relative and absolute",
                "Fixed position",
                "z-index",
                "Overflow create a profile picture",
                "Media queries",
                "Responsive navbar",
                "Responsive image",
                "Flexbox introduction",
                "Flex grow"
            ]
        }
    },
    {
        "id": "3",
        "name": "Bootstrap 5",
        "time": "7h 30m",
        "coursePrice": "50",
        "ratings": "4.5",
        "thumbnail": "https://i.postimg.cc/Xv8MRTHL/bootstrap5.jpg",
        "instructor": "Fatah Gabrial",
        "lesson": "4",
        "details_info": {
            "description": "Bootstrap is a popular framework designed for the building and development of responsive web applications. With Bootstrap 5, the framework has more UI elements and comes with more advanced features. More than a million websites use Bootstrap and their framework for front-end development.In this course, you will learn Bootstrap 5 from scratch to an advanced level. You will learn to build 3 Live Real-World projects with the latest Bootstrap 5 CSS framework. We will go through the Bootstrap 5 documentation step by step and learn how to use the UI elements.Now, before you can get started, you need to have some prerequisites for this course. Although this Bootstrap 5 course covers everything from scratch. You need some skills to get started.",
            "topics": [
                "Layout",
                "Forms",
                "Components",
                "Helpers",
                "Utilities",
                "5 Projects"
            ]
        }
    },
    {
        "id": "4",
        "name": "Tailwind CSS",
        "time": "10h 30m",
        "coursePrice": "100",
        "ratings": "5",
        "thumbnail": "https://i.postimg.cc/0jzLJr8X/tailwind.jpg",
        "instructor": "Brad Traversy",
        "lesson": "4",
        "details_info": {
            "description": "This is a fun project-based course to learn how to create awesome layouts using the Tailwind CSS framework and get comfortable using utility classes over something like Bootstrap, which uses component-based classes. Let's take a look at the outline for this course Tailwind CSS is basically a Utility first CSS framework for building rapid custom UI. It is a highly customizable, low-level CSS framework that gives you all of the building blocks that you need. Also, it is a cool way to write inline styling and achieve an awesome interface without writing a single line of your own CSS.",
            "topics": [
                "Layout",
                "Forms",
                "Components",
                "Helpers",
                "Utilities",
                "5 Projects",
                "Modals"
            ]
        }
    },
    {
        "id": "5",
        "name": "JavaScript",
        "time": "18h 30m",
        "coursePrice": "130",
        "ratings": "4.5",
        "thumbnail": "https://i.postimg.cc/rmnBm5Lt/js.jpg",
        "instructor": "Jonas Schmedtmann",
        "lesson": "16",
        "details_info": {
            "description": "Really, really well made course. Super in-depth, with great challenges and projects that will solidify your Javascript understanding. I found the lectures were paced perfectly -- Jonas doesn't skip over anything that might be useful to a JS developer Carson Bartholomew JavaScript is the most popular programming language in the world. It powers the entire modern web. It provides millions of high-paying jobs all over the worldThat's w hy you want to learn JavaScript too. And you came to the right place!",
            "topics": [
                "js fandamantal",
                "variable",
                "loop",
                "Function",
                "basic to advance",
                "5 Projects",
                "Modals with Alert"
            ]
        }
    },
    {
        "id": "6",
        "name": "React JS",
        "time": "13h 30m",
        "coursePrice": "180",
        "ratings": "5",
        "thumbnail": "https://i.postimg.cc/W4jLf2nt/ReactJS.png",
        "instructor": "Schwarzmüller",
        "lesson": "16",
        "details_info": {
            "description": "This course is fully up-to-date with React 18 (the latest version of React)! It was completely updated and re-recorded from the ground up - it teaches the very latest version of React with all the core, modern features you need to know! course also comes with two paths which you can take: The complete path (full >40h course) and the path (~4h summary module) - you can choose the path that best fits your time requirements! :-) .js is THE most popular JavaScript library you can use and learn these days to build modern, reactive user interfaces for the web. This course teaches you React in-depth, from the ground up, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well.",
            "topics": [
                "React js fandamantal",
                "side effect",
                "Use State",
                "Function",
                "basic to advance",
                "5 Projects",
                "React latest Package"
            ]
        }
    },
    {
        "id": "7",
        "name": "MongoDB",
        "time": "12h 30m",
        "coursePrice": "100",
        "ratings": "4.5",
        "thumbnail": "https://i.postimg.cc/qMhTNDqB/mongodb.jpg",
        "instructor": "Bogdan Stashchuk",
        "lesson": "4",
        "details_info": {
            "description": "MongoDB tutorial provides basic and advanced concepts of SQL. Our MongoDB tutorial is designed for beginners and professionals. MongoDB is a No SQL database. It is an open-source, cross-platform, document-oriented database written in C++. Our MongoDB tutorial includes all topics of MongoDB database such as insert documents, update documents, delete documents, query documents, projection, sort() and limit() methods, create a collection, drop collection, etc. There are also given MongoDB interview questions to help you better understand the MongoDB database.",
            "topics": [
                "MongoDB fandamantal",
                "installation",
                "Cloud service",
                "MongoDB shell",
                "basic to advance",
                "5 Projects",
                "DAta Types"
            ]
        }
    },
    {
        "id": "8",
        "name": "React Native",
        "time": "12h 30m",
        "coursePrice": "110",
        "ratings": "4.5",
        "thumbnail": "https://i.postimg.cc/wxPKY5VC/React-Native-Featured-Image.png",
        "instructor": "Andrei Neagoie",
        "lesson": "8",
        "details_info": {
            "description": "React Native is like React, but it uses native components instead of web components as building blocks. So to understand the basic structure of a React Native app, you need to understand some of the basic React concepts, like JSX, components, state, and props. If you already know React, you still need to learn some React Native specific stuff, like the native components. This tutorial is aimed at all audiences, whether you have React experience or not What's going on here? First of all, we need to import React to be able to use JSX, which will then be transformed to the native components of each platform.",
            "topics": [
                "React Native fandamantal",
                "installation",
                "the 2 path",
                "focus time app",
                "camera modules",
                "5 Projects",
                "maps intregation"
            ]
        }
    },
    {
        "id": "9",
        "name": "Python",
        "time": "12h 30m",
        "coursePrice": "200",
        "ratings": "4.5",
        "thumbnail": "https://i.postimg.cc/W31RTXxv/python.jpg",
        "instructor": "Dr. Angela Yu",
        "lesson": "18",
        "details_info": {
            "description": "The Complete Python Pro Bootcamp, the only course you need to learn to code with Python. With over 500,000 5 STAR reviews and a 4.8 average, my courses are some of the HIGHEST RATED courses in the history of Udemy! This Python tutorial has been written for the beginners to help them understand the basic to advanced concepts of Python Programming Language. After completing this tutorial, you will find yourself at a great level of expertise in Python, from where you can take yourself to the next levels to become a world class Software Engineer. What is Python? Python is a very popular general-purpose interpreted, interactive, object-oriented, and high-level programming language. Python is dynamically-typed and garbage-collected programming language.",
            "topics": [
                "Python fandamantal",
                "installation",
                "Begginer to advance",
                "maupulation",
                "Ramdomisation and list",
                "5 Projects",
                "function output",
                "Dictionaries nesting"
            ]
        }
    },
    {
        "id": "10",
        "name": "C++",
        "time": "12h 30m",
        "coursePrice": "190",
        "ratings": "4.5",
        "thumbnail": "https://i.postimg.cc/D0RRQF0v/c.png",
        "instructor": "Dr. Frank Mitropoulos",
        "lesson": "20",
        "details_info": {
            "description": "C++ is a middle-level programming language developed by Bjarne Stroustrup starting in 1979 at Bell Labs. C++ runs on a variety of platforms, such as Windows, Mac OS, and the various versions of UNIX. This C++ tutorial adopts a simple and practical approach to describe the concepts of C++ for beginners to advanded software engineers. Why to Learn C++ is a MUST for students and working professionals to become a great Software Engineer. I will list down some of the key advantages of learning C++: C++ is very close to hardware, so you get a chance to work at a low level which gives you lot of control in terms of memory management, better performance and finally a robust software.",
            "topics": [
                "Python fandamantal",
                "Installation and Setup Overview",
                "Begginer to advance",
                "structure c proggraming",
                "variables and constansts",
                "5 Projects",
                "controlling proggrams",
                "charactars and strings"
            ]
        }
    }
]